reading-notes/software-engineering/concepts-in-cm-systems.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2019-11-16 Sat 18:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
original source: <a href="https://sceweb.uhcl.edu/boetticher/swen5230/concepts-in-configuration-management.pdf">https://sceweb.uhcl.edu/boetticher/swen5230/concepts-in-configuration-management.pdf</a>
</p>

<p>
This paper is a bit outdated but contains a good overview of what configuration management means,
and what the functionalities of a CM system are, and how CM is used by different roles.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Definition of configuration management</h2>
<div class="outline-text-2" id="text-2">
<p>
The term is defined in the <a href="https://ieeexplore.ieee.org/document/7435207">729-1983 - IEEE Standard Glossary of Software Engineering Terminology</a>.
</p>

<p>
configuration management (CM). A discipline applying technical and administrative
 direction and surveillance to: identify
and document the functional and physical
characteristics of a configuration item,
control changes to those characteristics,
record and report change processing and
implementation status, and verify compliance with specified requirements.
</p>

<p>
CM should
</p>

<ul class="org-ul">
<li>identify a products structure
</li>
<li>control releases and changes
</li>
<li>gather statistics and manage change requests and component status
</li>
<li>ensure that a product is well defined assembly of components
</li>
</ul>
<p>
and adheres to standards, audit and review
</p>


<p>
A CM system should implement functionality for all these aspects, 
but in reality implements only a part of them, and stuff beyond that.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> User scenario</h2>
<div class="outline-text-2" id="text-3">
<p>
CM is and important thing of daily work from many perspectives
</p>

<ul class="org-ul">
<li>The project manager wants to deliver timely, so he is interested in statistics and reviews
</li>
<li>the configuaration manager (?) makes sure procedures for creating, reviewing, testing
</li>
</ul>
<p>
code are followed, tracks which components are problematic, makes system info available
</p>
<ul class="org-ul">
<li>Software engineers want to work effectively and use CM to manage tasks, merge changes
</li>
<li>testers track test results for different versions/configurations
</li>
<li>QA track bugs and assign them to different versions, and follow up on customer complaint
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Functionality of a CM system</h2>
<div class="outline-text-2" id="text-4">
<p>
The above yields the following functionality every CM system should have
</p>


<ul class="org-ul">
<li>Identification, classification, store &amp; retrieval of the different components that make
</li>
</ul>
<p>
up a system. Versioning of components, definition what components make up what is a working
system, definition of baselines ("significant states")
</p>
<ul class="org-ul">
<li>Reveal structure of the overall sytem (e.g. component interdependencies), system modelling,
</li>
</ul>
<p>
compatibility tracking
</p>
<ul class="org-ul">
<li>Should provide a way of (re-) building the artifacts
</li>
<li>enables teamwork and the development process with
mechanisms for bugtracking/changerequest and merging of work, access control.
</li>
<li>Enables reports and audits of the system, change history, work log.
</li>
</ul>



<p>
&#x2026; The rest of the paper describes things like when to use CM, and CM automation,
along with a extensive description of CM systems and their concepts, which i skipped reading for now.
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Summary</a></li>
<li><a href="#sec-2">2. Definition of configuration management</a></li>
<li><a href="#sec-3">3. User scenario</a></li>
<li><a href="#sec-4">4. Functionality of a CM system</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
